InformationRegisters/ЗначениеРеквизитовПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЗначениеРеквизитовПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВидаОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИмениТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИмениРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыЗаданияДаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СпособыЗаданияДаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезСрокаГодности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неизвестно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОграничен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИнтервал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВнесениеСведенийОЛабораторныхИсследованиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ВнесениеСведенийОЛабораторныхИсследованиях</Name>
			<BasedOn>
				<xr:Item>Document.ПроизводственныеОперации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроизводственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Иммунизация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеСведения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заболевание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаболеванияЖивыхЖивотных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСобытия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Препарат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Препараты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияПрепарата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииПрепаратов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыМероприятий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛабораторныеИсследования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОтбораПроб</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПолученияРезультата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеСведения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заключение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСобытия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодИсследования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МетодыИсследований</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерАктаОтбораПроб</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЭкспертизы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияОператор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОрганизацииОператоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательБезопасности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиБезопасности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательБолезни</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиБолезней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатИсследования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыЛабораторногоИсследования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЗначениеРеквизитовПоУмолчанию/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ТипРеквизита) Тогда
		
		УстановитьОграничениеТипаРеквизита();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ИмяРеквизита) Тогда
		
		УстановитьОграничениеСпискаЗначение();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗначениеРеквизитаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ЗначениеРеквизита) и Не ЗначениеЗаполнено(Запись.ТипРеквизита) Тогда
		ПолучитьТипВыбанногоЗначения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает доступные для выбора типы, реквизита ЗначениеРеквизита
// Доступные типы берутся реквизита ТипРеквизита записи регистра.
//
&НаСервере
Процедура УстановитьОграничениеТипаРеквизита()
	ТипРеквизита=Запись.ТипРеквизита;
	Элемент=Элементы.ЗначениеРеквизита;
	
	Если Найти(ТипРеквизита,"Ссылка.")=0 Тогда
		ТипРеквизита = СтрЗаменить(ТипРеквизита,".","Ссылка.");
	КонецЕсли;
	
	Тип = Новый ОписаниеТипов(ТипРеквизита);
	
	Элемент.ОграничениеТипа = Тип;
	Тип.ПривестиЗначение(Элемент);

КонецПроцедуры

// Устанавливает доступные для выбора значения, для некоторых реквизитов
&НаСервере
Процедура УстановитьОграничениеСпискаЗначение()
	
	Если Запись.ИмяРеквизита = "ТипТТН" Тогда
		Элементы.ЗначениеРеквизита.РежимВыбораИзСписка = Истина;
		Элементы.ЗначениеРеквизита.СписокВыбора.ЗагрузитьЗначения(Справочники.ТипыТТН.СписокРазрешенныхТиповТТН());
	ИначеЕсли Запись.ИмяРеквизита = "ФорматДатыВыработки" Или Запись.ИмяРеквизита = "ФорматСрокаГодности" Тогда
		Элементы.ЗначениеРеквизита.РежимВыбораИзСписка = Истина;
		Элементы.ЗначениеРеквизита.СписокВыбора.Добавить(Перечисления.СпособыЗаданияДаты.Дата);
		Элементы.ЗначениеРеквизита.СписокВыбора.Добавить(Перечисления.СпособыЗаданияДаты.Месяц);
		Элементы.ЗначениеРеквизита.СписокВыбора.Добавить(Перечисления.СпособыЗаданияДаты.Год);
		Если Запись.ИмяРеквизита = "ФорматДатыВыработки" Тогда
			Элементы.ЗначениеРеквизита.СписокВыбора.Добавить(Перечисления.СпособыЗаданияДаты.Неизвестно);
		Иначе
			Элементы.ЗначениеРеквизита.СписокВыбора.Добавить(Перечисления.СпособыЗаданияДаты.НеОграничен);
		КонецЕсли;
	ИначеЕсли Запись.ИмяРеквизита = "ПроводиласьВетсанэкспертиза" Тогда
		Элементы.ЗначениеРеквизита.РежимВыбораИзСписка = Истина;
		Элементы.ЗначениеРеквизита.СписокВыбора.ЗагрузитьЗначения(Справочники.РезультатыЛабораторногоИсследования.МассивРазрешенныхРезультатовИсследований());
	ИначеЕсли Запись.ИмяРеквизита = "ТипМероприятия" Тогда
		Элементы.ЗначениеРеквизита.РежимВыбораИзСписка = Истина;
		Элементы.ЗначениеРеквизита.СписокВыбора.Добавить(Справочники.ТипыМероприятий.ИммунизацияЖивогоЖивотного);
		Элементы.ЗначениеРеквизита.СписокВыбора.Добавить(Справочники.ТипыМероприятий.ОбработкаЖивогоЖивотного);
	ИначеЕсли Запись.ИмяРеквизита = "РезультатИсследования" Тогда
		Элементы.ЗначениеРеквизита.РежимВыбораИзСписка = Истина;
		Элементы.ЗначениеРеквизита.СписокВыбора.Добавить(Справочники.РезультатыЛабораторногоИсследования.ОтрицательныйРезультат);
		Элементы.ЗначениеРеквизита.СписокВыбора.Добавить(Справочники.РезультатыЛабораторногоИсследования.ПоложительныйРезультат);
		Элементы.ЗначениеРеквизита.СписокВыбора.Добавить(Справочники.РезультатыЛабораторногоИсследования.РезультатНевозможноОпределить);
		Если Запись.ВидОбъекта.ПолноеИмя = "Документ.ВнесениеСведенийОЛабораторныхИсследованиях" Тогда
			Элементы.ЗначениеРеквизита.СписокВыбора.Добавить(Справочники.РезультатыЛабораторногоИсследования.РезультатНеизвестен);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

 // Заполняет реквизит ТипРеквизита полным именем объекта метаданных ЗначенияРеквизита
 //
 // Параметры
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
&НаСервере
Процедура ПолучитьТипВыбанногоЗначения()
	Если ТипЗнч(Запись.ЗначениеРеквизита) = Тип("Строка") Тогда
		ПолноеИмя = "Строка";
	ИначеЕсли ТипЗнч(Запись.ЗначениеРеквизита) = Тип("Число") Тогда
		ПолноеИмя = "Число";
	ИначеЕсли ТипЗнч(Запись.ЗначениеРеквизита) = Тип("Дата") Тогда
		ПолноеИмя = "Дата";
	ИначеЕсли ТипЗнч(Запись.ЗначениеРеквизита) = Тип("Булево") Тогда
		ПолноеИмя = "Булево";
	Иначе
		ПолноеИмя = Запись.ЗначениеРеквизита.Метаданные().ПолноеИмя();
	КонецЕсли;
	Запись.ТипРеквизита = ПолноеИмя;
КонецПроцедуры

#КонецОбласти
